Repository: mozilla-l10n/mt-training-data
Catalog: ug/ug_pontoon.tmx
Source language: en_us
Languages: ug

source: Are you sure that you want to clear all the permissions on all sites?
ug: بارلىق تور بېكەتلەردىكى ھەممە ئىجازەتلەرنى راستىنلا ئۆچۈرەمسىز؟

source: Are you sure that you want to clear this permission for this site?
ug: بۇ تور بېكەتتىكى مەزكۇر ئىجازەتنى راستىنلا ئۆچۈرەمسىز؟

source: Are you sure you want to delete %1$s?
ug: بۇ %1$s نى راستىنلا ئۆچۈرەمسىز؟

source: Are you sure you want to delete the selected items?
ug: تاللىغان تۈرنى راستتىنلا ئۆچۈرەمسىز؟

source: Are you sure you want to delete this address?
ug: بۇ ئادرېسنى راستىنلا ئۆچۈرەمسىز؟

source: Are you sure you want to delete this bookmark?
ug: بۇ خەتكۈچنى راستىنلا ئۆچۈرەمسىز؟

source: Are you sure you want to delete this credit card?
ug: بۇ ئىناۋەتلىك كارتىنى راستىنلا ئۆچۈرەمسىز؟

source: Are you sure you want to delete this folder?
ug: بۇ قىسقۇچنى راستىنلا ئۆچۈرەمسىز؟

source: Are you sure you want to delete this login?
ug: بۇ كىرىشنى راستىنلا ئۆچۈرەمسىز؟

source: Are you sure you want to delete this password?
ug: بۇ ئىمنى راستىنلا ئۆچۈرەمسىز؟

source: Articles powered by %s
ug: ماقالە تەمىنلىگۈچى %s

source: Artist series
ug: سەنئەتكار يۈرۈشلۈكلىرى

source: A site is playing media
ug: بېكەت ۋاسىتە قويۇۋاتىدۇ

source: Ask %1$s to auto refuse cookies
ug: %1$s ساقلانمىنى ئۆزلۈكىدىن رەت قىلغاندا سورايدۇ

source: Ask before opening
ug: ئېچىشتىن ئىلگىرى سورا

source: Ask to add site
ug: تور بېكەت قوشقاندا سورا

source: Ask to allow
ug: ئىجازەت سورا

source: Ask to save
ug: ساقلاشنى سورا

source: Audio and video will play on Wi-Fi
ug: ئۈن ۋە سىننى Wi-Fi دا قويىدۇ

source: Aug
ug: ئاۋغۇست

source: Author
ug: يازغۇچى

source: Authors
ug: ئاپتورلار

source: Auto-close after one month?
ug: بىر ئايدىن كېيىن ئاپتوماتىك ياپامدۇ؟

source: Auto-close enabled
ug: ئاپتوماتىك تاقاش قوزغىتىلدى

source: Auto-close open tabs
ug: ئوچۇق بەتكۈچلەرنى ئاپتوماتىك تاقاش

source: Autocomplete URLs
ug: ئۆزلۈكىدىن تاماملانغان تور ئادرېسلىرى

source: Autofill
ug: ئاپتوماتىك تولدۇر

source: Autofill in %1$s
ug: %1$s دا ئاپتوماتىك تولدۇر

source: Autofill in other apps
ug: باشقا ئەپلەردە ئاپتوماتىك تولدۇرىدۇ

source: Automatic
ug: ئاپتوماتىك

source: Automatically attempts to connect to sites using HTTPS encryption protocol for increased security.
ug: بىخەتەرلىكنى ئۆستۈرۈش ئۈچۈن HTTPS مەخپىيلەشتۈرۈش كېلىشىمنامىسى ئارقىلىق تور بېكەتلەرگە ئاپتوماتىك ئۇلىنىدۇ.

source: Automatically deletes browsing data when you select \"Quit\" from the main menu
ug: باش تىزىملىكتىن «چېكىن» نى تاللىغاندا توركۆرگۈ سانلىق مەلۇماتلىرىنى ئاپتوماتىك ئۆچۈرىدۇ

source: Automatically send crash reports
ug: يىمىرىلىش دوكلاتىنى ئۆزلۈكىدىن يوللايدۇ

source: Automatically submit crash reports
ug: يىمىرىلىش دوكلاتىنى ئۆزلۈكىدىن يوللايدۇ

source: Automatic font sizing
ug: ئاپتوماتىك خەت چوڭلۇقى

source: Automatic translation
ug: ئاپتوماتىك تەرجىمە

source: Autoplay
ug: ئاپتوماتىك قويۇش

source: Available languages
ug: قوللايدىغان تىللار

source: Back to main menu
ug: ئاساسىي تىزىملىككە قايت

source: Based on reliable reviews
ug: ئىشەنچلىك باھالار ئاساس قىلىندى

source: BETA
ug: سىناق نەشرى

source: <b>Highlights</b> are from %s reviews within the last 80 days that we believe to be reliable.
ug: <b>يارقىن نۇقتىلار</b> بىز ئىشەنچلىك دەپ قارىغان يېقىنقى 80 كۈن ئىچىدىكى %s باھادىن كەلگەن.

source: Block
ug: توسۇش

source: Block ads effectively and efficiently.
ug: ئېلاننى ئەمەلىي ۋە ئۈنۈملۈك توسىدۇ.

source: Block audio and video
ug: ئۈن ۋە سىننى چەكلە

source: Block audio and video on cellular data only
ug: كۆچمە سانلىق مەلۇماتتىلا ئۈن ۋە سىننى توسىدۇ

source: Block audio only
ug: ئاۋازنىلا چەكلە

source: Block content on any page
ug: ھەر قانداق بەتتىكى مەزمۇننى چەكلەش

source: Blocked
ug: توسۇلغان

source: Blocked by Android
ug: ئاندىرويىد توسقان

source: Blocks cookies that ad networks and analytics companies use to compile your browsing data across many sites.
ug: تور تەھلىل شىركەتلىرى ۋە ئېلان تورلىرى تور بېكەت ھالقىپ تور كۆرگۈ سانلىق مەلۇماتلىرىنى توپلايدىغان ساقلانمىلارنى توسىدۇ.

source: Bookmark
ug: خەتكۈچ

source: Bookmarks
ug: خەتكۈچ

source: Bookmark saved!
ug: خەتكۈچ ساقلاندى!

source: Bookmarks deleted
ug: خەتكۈچ ئۆچۈرۈلدى

source: Bookmarks Menu
ug: خەتكۈچ تىزىملىك

source: Bookmarks saved!
ug: خەتكۈچ ساقلاندى!

source: Bookmarks saved in “%s”!
ug: خەتكۈچ «%s» غا ساقلاندى!

source: Bookmarks Toolbar
ug: خەتكۈچ قورال بالداق

source: Bookmark this page
ug: بۇ بەتنى خەتكۈچكە قوش

source: Bottom
ug: ئاستى

source: Browse faster with new navigation
ug: يېڭى يولباشچى ئىشلىتىلسە، تور كۆرگۈ تېزلىشىدۇ

source: Browse with no saved cookies or history in %1$s
ug: %1$s زىيارەت داۋامىدا cookies ۋە تارىخ خاتىرىسىنى ساقلىمايدۇ

source: Browse without a trace
ug: ئىزسىز زىيارەت

source: Browsing data deleted
ug: توركۆرگۈ سانلىق مەلۇماتى ئۆچۈرۈلدى

source: Browsing history
ug: زىيارەت تارىخى

source: Buttons, links, and other content
ug: توپچە، ئۇلانما ۋە باشقا مەزمۇن

source: By selecting “Yes, try it” you agree to %1$s by Mozilla’s %2$s and %3$s.
ug: «ھەئە، سىناپ باقاي» تاللانسا سىز Mozilla نىڭ %2$s ۋە %3$s دىكى %1$s غا قوشۇلغان بولىسىز.

source: By selecting “Yes, try it” you agree to %1$s’s %2$s and %3$s’s %4$s.
ug: «ھەئە، سىناپ باقاي» تاللانسا %1$s نىڭ %2$s ۋە %3$s نىڭ %4$s غا قوشۇلغان بولىسىز.

source: By selecting “Yes, try it” you agree to the following from %1$s:
ug: «ھەئە، سىناپ باقاي» تاللانسا تۆۋەندىكى %1$s غا قوشۇلغان بولىسىز:

source: Cached images and files
ug: غەملەنگەن سۈرەت ۋە ھۆججەت

source: Call
ug: چاقىرىش

source: Call with…
ug: تېلېفون قىلىش…

source: Camera
ug: كامېرا

source: Camera access needed. Go to Android settings, tap permissions, and tap allow.
ug: كامېرا ئىجازىتى زۆرۈر. ئاندىرويىد تەڭشىكىگە يۆتكىلىپ، ئىجازەتنى چېكىپ، ئاندىن يول قوينى چېكىڭ.

source: Camera and microphone are on
ug: كامېرا ۋە مىكروفون ئوچۇق

source: Camera is on
ug: كامېرا ئېچىلدى

source: Cancel
ug: ۋاز كەچ

source: Cancel %1$s download?
ug: %1$s نى چۈشۈرۈشتىن ۋاز كېچەمدۇ؟

source: Cancel downloads
ug: چۈشۈرۈشتىن ۋاز كەچ

source: Cancel private downloads?
ug: شەخسىي چۈشۈرۈشتىن ۋاز كېچەمدۇ؟

source: Cannot Complete Request
ug: تەلەپنى تاماملىيالمايدۇ

source: Cannot share to this app
ug: بۇ ئەپكە ھەمبەھىرلىيەلمەيدۇ

source: Can’t edit default folders
ug: كۆڭۈلدىكى قىسقۇچنى تەھرىرلىيەلمەيدۇ

source: Can’t install extension
ug: كېڭەيتىلمىنى ئورنىتالمايدۇ

source: Can’t save password
ug: ئىم ساقلىيالمايدۇ

source: Card Number
ug: كارتا نومۇرى

source: Card number will be encrypted. Security code won’t be saved.
ug: كارتا نومۇرى شىفىرلىنىدۇ. بىخەتەرلىك كودى ساقلانمايدۇ.

source: CFR Tools
ug: CFR قورالى

source: Change your password, manage data collection, or delete your account
ug: ئىم ئۆزگەرتىش، سانلىق مەلۇمات توپلىمىنى باشقۇرۇش ياكى ھېسابات ئۆچۈرۈش

source: Checking review quality
ug: باھالاش سۈپىتىنى تەكشۈرۈۋاتىدۇ

source: Checking review quality (%s)
ug: باھالاش سۈپىتىنى تەكشۈرۈۋاتىدۇ(%s)

source: Check now
ug: ھازىر تەكشۈر

source: Check out 100+ new extensions that let you make Firefox your own.
ug: ئۆزىڭىزنىڭ Firefox غا ئايلاندۇرىدىغان 100+ يېڭى كېڭەيتىلمىلەرنى تاپالايسىز.

source: Check review quality
ug: باھالاش سۈپىتىنى تەكشۈر

source: Check that search string matches Example format
ug: ئىزدەيدىغان تىزىق ماس كېلىدىغان مىسال پىچىمنى تەكشۈرىدۇ

source: Check your network connection and then try reloading the page.
ug: تور باغلىنىشىڭىزنى تەكشۈرۈپ ئاندىن بەتنى قايتا يۈكلەڭ.

source: Check your network connection or try reloading the page in a few moments.
ug: تور ئۇلىنىشىڭىزنى تەكشۈرۈڭ ياكى بىر نەچچە مىنۇتتىن كېيىن بەتنى قايتا يۈكلەڭ.

source: Choose a color
ug: رەڭ تاللىنىدۇ

source: Choose a language
ug: تىل تاللىنىدۇ

source: Choose a login provider
ug: تىزىمغا كىرىشنى تەمىنلىگۈچى تاللىنىدۇ

source: Choose an account
ug: ھېسابات تاللىنىدۇ

source: Choose a wallpaper that speaks to you.
ug: سىز ياقتۇرىدىغان تام قەغەزنى تاللاڭ.

source: Choose reason
ug: سەۋەب تاللىنىدۇ

source: Choose what to sync
ug: قەدەمداش تاللىنىدۇ

source: Choose which trackers and scripts to block.
ug: قايسى ئىز قوغلىغۇچ ۋە قوليازمىلارنى توسىدىغانلىقى تاللىنىدۇ.

source: City
ug: شەھەر

source: Classic %s
ug: ئەنئەنىۋى %s

source: Clear
ug: تازىلاش

source: Clear cookies and site data
ug: Cookies ۋە تور بېكەت سانلىق مەلۇماتلىرىنى ئۆچۈرىدۇ

source: Clear hostname
ug: مۇلازىم ئىسمىنى تازىلا

source: Clear password
ug: ئىم تازىلا

source: Clear permission
ug: ئىجازەتنى تازىلا

source: Clear permissions
ug: ئىجازەتنى تازىلا

source: Clear permissions on all sites
ug: ھەممە تور بېكەتنىڭ ئىجازىتىنى تازىلايدۇ

source: Clear recent browsing history, cookies, and related data
ug: يېقىنقى كۆرۈش تارىخى ، ساقلانمىلار ۋە مۇناسىۋەتلىك سانلىق مەلۇماتلارنى تازىلاش

source: Clears cookies set by redirects to known tracking websites.
ug: مەلۇملۇق ئىزلىغۇچى تور بېكەتلەرنىڭ قايتا نىشانلاش تەڭشىكى بار ساقلانمىلارنى تازىلايدۇ.

source: Clear username
ug: ئىشلەتكۈچى ئىسمىنى تازىلا

source: Click for more details
ug: تەپسىلات ئۈچۈن چېكىڭ

source: Close after one day
ug: بىر كۈندىن كېيىن تاقا

source: Close after one month
ug: بىر ئايدىن كېيىن تاقا

source: Close after one week
ug: بىر ھەپتىدىن كېيىن تاقا

source: Close all inactive tabs
ug: بارلىق ئاكتىپسىز بەتكۈچلەرنى تاقايدۇ

source: Close all tabs
ug: ھەممە بەتكۈچنى ياپ

source: Close bookmarks
ug: خەتكۈچنى تاقا

source: Close custom tab menu sheet
ug: ئىختىيارى بەتكۈچ تىزىملىك جەدۋىلىنى تاقايدۇ

source: Close extensions menu sheet
ug: كېڭەيتىلمە تىزىملىك جەدۋىلىنى تاقايدۇ

source: Close main menu sheet
ug: ئاساسىي تىزىملىك جەدۋىلىنى تاقايدۇ

source: Close manually
ug: قولدا تاقا

source: Close private tabs
ug: شەخسىي بەتكۈچنى ياپ

source: Close private tabs?
ug: شەخسىي بەتكۈچنى ياپامدۇ؟

source: Close reader view
ug: ئوقۇرمەن كۆرۈنۈشىنى ياپ

source: Close review checker
ug: باھالاش تەكشۈرگۈچنى تاقا

source: Close save menu sheet
ug: ساقلاش تىزىملىك جەدۋىلىنى تاقايدۇ

source: Close survey
ug: راي سىناشنى تاقا

source: Close tab
ug: بەتكۈچنى تاقاش

source: Close tabs
ug: بەتكۈچنى ياپ

source: Close tab %s
ug: %s بەتكۈچنى ياپ

source: Close tools menu sheet
ug: قورال تىزىملىك جەدۋىلىنى تاقايدۇ

source: Close Translations sheet
ug: تەرجىمە جەدۋىلىنى تاقا

source: collapse
ug: يىغ

source: collapsed
ug: يىغىلدى

source: Collapse group of synced tabs
ug: قەدەمداشلانغان بەتكۈچ گۇرۇپپىسىنى يىغىدۇ

source: Collapse inactive tabs
ug: ئاكتىپسىز بەتكۈچلەرنى يىغىدۇ

source: Collapse saved addresses
ug: ساقلانغان ئادرېسنى يىغ

source: Collapse saved cards
ug: ساقلانغان كارتىنى يىغ

source: Collapse saved passwords
ug: ساقلىغان ئىمنى يىغ

source: Collapse suggested addresses
ug: تەۋسىيە ئادرېسنى يىغىدۇ

source: Collapse suggested credit cards
ug: تەۋسىيە قىلىنغان ئىناۋەتلىك كارتىنى يىغىدۇ

source: Collapse suggested logins
ug: تەۋسىيە كىرىشنى يىغ

source: Collection %d
ug: يىغقۇچ %d

source: Collection deleted
ug: يىغقۇچ ئۆچۈرۈلدى

source: Collection menu
ug: يىغقۇچ تىزىملىكى

source: Collection name
ug: يىغقۇچ ئىسمى

source: Collection owner (User ID)
ug: توپلىغۇچى ئىگىسى (ئىشلەتكۈچى كىملىكى)

source: Collection renamed
ug: يىغقۇچ ئىسمى ئۆزگەرتىلدى

source: Collections
ug: يىغقۇچ

source: Collection saved!
ug: يىغقۇچ ساقلاندى!

source: Collect the things that matter to you.\nGroup together similar searches, sites, and tabs for quick access later.
ug: كېرەكلىك نەرسىلەر بۇ جايغا يىغىلىدۇ.\nكېيىن تېز زىيارەت قىلىش ئۈچۈن ئوخشىشىپ كېتىدىغان ئىزدەش، بېكەت ۋە بەتكۈچلەر گۇرۇپپىلىنىدۇ.

source: Common myths about private browsing
ug: شەخسىيەت زىيارىتى ھەققىدە كۆپ ئۇچرايدىغان قاراشلار

source: Competitiveness
ug: رىقابەت كۈچى

source: Complete action using
ug: تۆۋەندىكى ئەپتە مەشغۇلاتنى تاماملايدۇ

source: Complete this survey
ug: بۇ تەكشۈرۈشنى تاماملاڭ

source: Connect another device
ug: باشقا ئۈسكۈنىگە باغلىنىدۇ

source: Connect another device.
ug: باشقا ئۈسكۈنىگە باغلىنىدۇ.

source: Connect Another Device…
ug: باشقا ئۈسكۈنىگە باغلىنىۋاتىدۇ…

source: Connection is not secure
ug: باغلىنىش بىخەتەر ئەمەس

source: Connection is secure
ug: باغلىنىش بىخەتەر

source: Content
ug: مەزمۇن

source: Content crashed
ug: مەزمۇن بۇزۇلغان

source: Content Encoding Error
ug: مەزمۇن كودلاش خاتالىقى

source: Continue to HTTP Site
ug: HTTP تور بېتىنى داۋاملاشتۇرۇش

source: Continue to website
ug: توربېكەتنى داۋاملاشتۇر

source: Continue with add-ons disabled
ug: قوشۇلمىنى چەكلەپ داۋاملاشتۇرىدۇ

source: Continue with extensions disabled
ug: كېڭەيتىلمىنى چەكلەپ داۋاملاشتۇرىدۇ

source: Control browser proxy settings
ug: توركۆرگۈ ۋاكالەتچى تەڭشىكىنى باشقۇرۇش

source: Cookie Banner Blocker
ug: cookie لوزۇنكىسى توسقۇچ

source: Cookie Banner Blocker in private browsing
ug: شەخسىي تور زىيارەتتىكى cookie لوزۇنكىسىنى توسقۇچ

source: Cookie banner reduction
ug: cookie لوزۇنكىسىنى ئازايتىش

source: Cookies and site data
ug: Cookies ۋە تور بېكەت سانلىق مەلۇماتلىرى

source: Cookies from unvisited sites
ug: زىيارەت قىلمىغان بېكەتنىڭ Cookies سى

source: Copied to clipboard
ug: چاپلاش تاختىسىغا كۆچۈرۈلدى

source: Copy
ug: كۆچۈرۈش

source: Copy email address
ug: ئېلخەت ئادرېسىنى كۆچۈرۈش

source: Copy image
ug: سۈرەت كۆچۈر

source: Copy image location
ug: سۈرەت ئورنىنى كۆچۈر

source: Copy link
ug: ئۇلانمىنى كۆچۈرۈش

source: Copy password
ug: ئىم كۆچۈر

source: Copy to clipboard
ug: چاپلاش تاختىسىغا كۆچۈر

source: Copy username
ug: ئىشلەتكۈچى ئىسمىنى كۆچۈر

source: Corrupted Content Error
ug: بۇزۇلغان مەزمۇن خاتالىقى

source: Could not open file
ug: ھۆججەتنى ئاچالمىدى

source: Couldn’t change wallpaper
ug: تام قەغىزىنى ئۆزگەرتەلمىدى

source: Couldn’t delete <b>%1$s</b>. Please try again.
ug: <b>%1$s</b> نى ئۆچۈرەلمىدى. قايتا سىناڭ.

source: Couldn’t download <b>%1$s</b>. Please try again.
ug: <b>%1$s</b> نى چۈشۈرەلمىدى. قايتا سىناڭ.

source: Couldn’t download wallpaper
ug: تام قەغىزىنى چۈشۈرەلمىدى

source: Couldn’t load languages. Check your internet connection and try again.
ug: تىلنى يۈكلىيەلمىدى. تور باغلىنىشىڭىزنى تەكشۈرۈپ قايتا سىناڭ.

source: Couldn’t load languages. Please check back later.
ug: تىلنى يۈكلىيەلمەيدۇ. كېيىن قايتا تەكشۈرۈڭ.

source: Couldn’t load sites. Please check back later.
ug: تور بېكەتنى يۈكلىيەلمەيدۇ. كېيىن قايتا تەكشۈرۈڭ.

source: Country or region
ug: دۆلەت ياكى رايون

source: Crashes
ug: يىمىرىلىش

source: Crash Reports
ug: يىمىرىلىش دوكلاتى

source: Crash reports allow us to diagnose and fix issues with the browser. Reports may include personal or sensitive data.
ug: يىمىرىلىش دوكلاتى توركۆرگۈگە دىياگنوز قۇيۇپ ۋە ئۇنى ئوڭشاشقا يول قويىدۇ. دوكلات شەخسىي ياكى سەزگۈر ئۇچۇرلارنى ئۆز ئىچىگە ئېلىشى مۇمكىن.

source: Created %s
ug: %s قۇرۇلدى

source: Credit cards
ug: ئىناۋەتلىك كارتا

source: Cross-site and social media trackers
ug: بېكەت ھالقىپ ۋە ئىجتىمائىي تاراتقۇ ئىزلىغۇچ

source: Cross-site cookies
ug: بېكەت ھالقىغان cookies

source: Cross-Site Cookies
ug: بېكەت ھالقىغان cookies

source: Cross-Site Tracking Cookies
ug: بېكەت ھالقىغان ئىزلاش cookie

source: Cryptominers
ug: شىفىرلىق پۇل قازغۇچ

source: Current domain: %s
ug: نۆۋەتتىكى دائىرە: %s

source: Custom
ug: ئىختىيارىچە

source: Custom Add-on collection
ug: ئىختىيارى قوشۇلما توپلىمى

source: Custom dark mode for the mobile web.
ug: كۆچمە تور ئۈچۈن ئىختىيارى قاراڭغۇ ھالەتنى تەڭشەيدۇ.

source: Custom Extension collection
ug: ئىختىيارى كېڭەيتىلمە توپلىمى

source: Custom Firefox Account server
ug: ئىختىيارى Firefox ھېسابات مۇلازىمېتىرى

source: Customize
ug: ئىختىيارىچە

source: Customize homepage
ug: باش بەتنى خاسلاشتۇر

source: Customize reader view
ug: ئوقۇرمەن كۆرۈنۈشىنى خاسلاشتۇر

source: Customize Reader View
ug: ئوقۇرمەن كۆرۈنۈشىنى خاسلاشتۇر

source: Customize your Firefox with extensions
ug: Firefox نى كېڭەيتىلمە ئارقىلىق خاشلاشتۇرىدۇ

source: Custom Mozilla account server
ug: ئىختىيارى Mozilla ھېسابات مۇلازىمېتىرى

source: Custom search engine details
ug: ئىختىيارى ئىزدەش موتورىنىڭ تەپسىلاتى

source: Custom Sync server
ug: ئىختىيارى قەدەمداش مۇلازىمېتىر

source: %d addresses
ug: %d ئادرېس

source: Dark
ug: قاراڭغۇ

source: Dark color scheme
ug: قېنىق رەڭ لايىھەسى

source: Data about your device, hardware configuration, and how you use Firefox helps improve features, performance, and stability for users everywhere.
ug: ئۈسكۈنىڭىز، قاتتىق دېتال سەپلىمىسى ۋە Firefox نى قانداق ئىشلىتىش ھەققىدىكى سانلىق مەلۇمات بىزنىڭ بارلىق ئىشلەتكۈچىلەر ئۈچۈن ئىقتىدارلارنى ياخشىلاش ۋە مۇقىملىقىنى ئاشۇرۇشىمىزغا ياردەم بېرىدۇ.

source: Data choices
ug: سانلىق مەلۇمات تاللاش

source: Data collection
ug: سانلىق مەلۇمات توپلاش

source: Data is encrypted
ug: سانلىق مەلۇمات شىفىرلانغان

source: Debug menu: %1$d click(s) left to enable
ug: سازلاش تىزىملىكى: %1$d چېكىلسە قوزغىتىدۇ

source: Debug menu enabled
ug: سازلاش تىزىملىكى قوزغىتىلدى

source: Debug Tools
ug: سازلاش قورالى

source: Dec
ug: دېكابر

source: Deceptive site issue
ug: ئالدامچىلىق تور بېكىتى مەسىلىسى

source: Default search engine
ug: كۆڭۈلدىكى ئىزدەش موتورى

source: Delete %1$s?
ug: %1$s نى ئۆچۈرەمدۇ؟

source: Delete %1$s (%2$s)?
ug: %1$s (%2$s) نى ئۆچۈرەمدۇ؟

source: Delete address
ug: ئادرېس ئۆچۈر

source: Delete all exceptions
ug: ھەممە مۇستەسنالارنى ئۆچۈرىدۇ

source: Delete all languages
ug: ھەممە تىلنى ئۆچۈر

source: Delete all languages (%1$s)?
ug: بارلىق تىللارنى ئۆچۈرەمدۇ (%1$s)؟

source: Delete all sites in “%s”
ug: «%s» دىكى بارلىق تور بېكەتلەرنى ئۆچۈرىدۇ

source: Delete bookmark
ug: خەتكۈچ ئۆچۈر

source: Delete browsing data
ug: توركۆرگۈ زىيارەت سانلىق مەلۇماتلىرىنى ئۆچۈرىدۇ

source: Delete browsing data on quit
ug: چېكىنگەندە توركۆرگۈ زىيارەت سانلىق مەلۇماتلىرىنى ئۆچۈرىدۇ

source: Delete card
ug: كارتىنى ئۆچۈر

source: Delete card?
ug: كارتىنى ئۆچۈرەمدۇ؟

source: Delete collection
ug: يىغقۇچنى ئۆچۈر

source: Deleted %1$s
ug: %1$s ئۆچۈرۈلدى

source: Deleted items: %s
ug: ئۆچۈرۈلگەن تۈر: %s

source: Deleted %s
ug: %s ئۆچۈرۈلدى

source: Delete folder
ug: قىسقۇچ ئۆچۈر

source: Delete from history
ug: تارىختىن ئۆچۈر

source: Delete history
ug: تارىخنى ئۆچۈر

source: Delete login with username %s
ug: ئىشلەتكۈچى ئاتى %s بولغان تىزىمغا كىرىش ئۇچۇرىنى ئۆچۈرىدۇ

source: Delete this address?
ug: بۇ ئادرېسنى ئۆچۈرەمدۇ؟

source: Delete website
ug: تور بېكەت ئۆچۈر

source: Deleting browsing data…
ug: توركۆرگۈ زىيارەت سانلىق مەلۇماتىنى ئۆچۈرۈۋاتىدۇ…

source: Deleting selected folders
ug: تاللانغان قىسقۇچنى ئۆچۈرۈۋاتىدۇ

source: Deleting this tab will delete the entire collection. You can create new collections at any time.
ug: بۇ بەتكۈچ ئۆچۈرۈلسە پۈتكۈل يىغقۇچنى ئۆچۈرۈۋېتىدۇ. خالىغان ۋاقىتتا يېڭى يىغقۇچ قۇرالايسىز.

source: Deny
ug: رەت قىلىش

source: DENY
ug: رەت قىل

source: Describe the problem (optional)
ug: مەسىلە بايانى (تاللاشچان)

source: Deselect all
ug: ھەممىنى تاللىما

source: Desktop Bookmarks
ug: ئۈستەل ئۈسكۈنە خەتكۈچى

source: Desktop site
ug: ئۈستەل يۈزى تور بېكىتى

source: Details
ug: تەپسىلاتى

source: Device name
ug: ئۈسكۈنە ئىسمى

source: Device name cannot be empty.
ug: ئۈسكۈنە ئىسمى بوش قالمايدۇ.

source: Disabled
ug: چەكلەندى

source: Disable private browsing
ug: شەخسىي زىيارەتنى چەكلە

source: Disconnect
ug: ئۇلانمىنى ئۈز

source: Discover more
ug: تېخىمۇ كۆپ بايقاش

source: Discover more extensions
ug: تېخىمۇ كۆپ كېڭەيتمە بايقا

source: Dismiss
ug: بولدىلا

source: Dismiss find in page
ug: بەتتىن ئىزدەشنى ياپ

source: Display notifications to you
ug: سىزگە ئۇقتۇرۇشنى كۆرسىتىدۇ

source: Dissatisfied
ug: نارازى

source: Don’t allow
ug: رۇخسەت بەرمە

source: Don’t save
ug: ساقلىما

source: Don’t update
ug: يېڭىلانمىسۇن

source: Download (%1$s)
ug: چۈشۈرۈش(%1$s)

source: Download and run AI models on your device
ug: سۈنئىي ئەقىل مودېلىنى ئۈسكۈنىڭىزگە چۈشۈرۈپ ئىجرا قىلىڭ

source: Download and translate
ug: چۈشۈرۈش ۋە تەرجىمە قىلىش

source: Download completed
ug: چۈشۈرۈش تاماملاندى

source: Download complete languages for faster translations and to translate offline. %1$s
ug: تېخىمۇ تېز ۋە تورسىز تەرجىمە قىلىش ئۈچۈن تىلنى تولۇق چۈشۈرۈڭ. %1$s

source: Download failed
ug: چۈشۈرۈش مەغلۇپ بولدى

source: Download files and read and modify the browser’s download history
ug: ھۆججەت چۈشۈرىدۇ ھەمدە توركۆرگۈنىڭ چۈشۈرۈش تارىخىنى ئوقۇپ ۋە ئۆزگەرتىدۇ

source: Downloading and verifying add-on…
ug: قىستۇرما چۈشۈرۈپ دەلىللىنىۋاتىدۇ…

source: Downloading and verifying extension…
ug: كېڭەيتىلمە چۈشۈرۈپ ۋە دەلىللەۋاتىدۇ…

source: Download language in data saving mode (%1$s)?
ug: سانلىق مەلۇمات ئېقىمىنى تېجەش ھالىتىدە تىلنى چۈشۈرەمدۇ(%1$s)؟

source: Download languages
ug: تىل چۈشۈر

source: Download Languages
ug: تىللارنى چۈشۈرۈش

source: Download link
ug: چۈشۈرۈش ئۇلانمىسى

source: Download paused
ug: چۈشۈرۈش توختىتىلدى

source: Downloads
ug: چۈشۈرۈلمىلەر

source: Downloads Removed
ug: چۈشۈرۈش چىقىرىۋېتىلدى

source: Download while in data saving mode (%1$s)?
ug: سانلىق مەلۇمات تېجەش ھالىتىدە چۈشۈرەمدۇ(%1$s)؟

source: Do you want to leave this site? Data you have entered may not be saved
ug: بۇ تور بېكەتتىن ئايرىلامسىز؟ سىز كىرگۈزگەن سانلىق مەلۇماتلار ساقلانماسلىقى مۇمكىن

source: %d page
ug: %d بەت

source: %d pages
ug: %d بەت

source: Drag from top & press back to exit
ug: يۇقىرىدىن سۆرەپ ئاندىن قايت توپچە بېسىلسا چېكىنىدۇ

source: Drag from top & use back gesture to exit
ug: يۇقىرىدىن سۆرەپ ئاندىن قايتۇرۇش قول ئىشارىتى ئىشلىتىلسە چېكىنىدۇ

source: DRM-controlled content
ug: DRM كونترول قىلىنىدىغان مەزمۇن

source: %d tab
ug: %d بەتكۈچ

source: %d tabs
ug: %d بەتكۈچ

source: %d tab selected
ug: %d بەتكۈچ تاللاندى

source: %d tabs selected
ug: %d بەتكۈچ تاللاندى

source: Duplicate tab
ug: تەكرار بەتكۈچ

source: EDIT
ug: تەھرىرلەش

source: Edit address
ug: ئادرېس تەھرىر

source: Edit bookmark
ug: خەتكۈچ تەھرىر

source: Edit card
ug: كارتا تەھرىر

source: Edit engines visible in the search menu
ug: ئىزدەش تىزىملىكىدە كۆرۈنىدىغان موتورلارنى تەھرىرلەيدۇ

source: Edit folder
ug: قىسقۇچ تەھرىر

source: Edit password
ug: ئىم تەھرىر

source: Edit search engine
ug: ئىزدەش موتورى تەھرىر

source: Edit shortcut
ug: تېزلەتمە تەھرىر

source: Email address copied to clipboard
ug: ئېلخەت ئادرېسى چاپلاش تاختىسىغا كۆچۈرۈلدى

source: Email with…
ug: ئېلخەت يوللاش…

source: Enabled
ug: قوزغىتىلدى

source: Enable Gecko logs
ug: Gecko خاتىرىسىنى قوزغات

source: Enable in all tabs
ug: بارلىق بەتكۈچتە قوزغات

source: Enable only in private tabs
ug: شەخسىي بەتكۈچتىلا قوزغات

source: Enable private browsing
ug: شەخسىي زىيارەتنى قوزغات

source: Enables fingerprinting protection to stop suspected fingerprinters.
ug: گۇمانلىق ئىز قالدۇرغۇنى توختىتىشتا ئىز قالدۇرغۇدىن قوغداش قوزغىتىلىدۇ.

source: Enable telemetry to send data.
ug: سانلىق مەلۇمات ئەۋەتىشتە تېلېگرافنى قوزغىتىدۇ.

source: Enable to allow pinch and zoom, even on websites that prevent this gesture.
ug: ھەتتا ئىشارەتنىڭ ئالدىنى ئالىدىغان تور بېكەتلەردىمۇ كىچىكلىتىش ۋە چوڭايتىشقا يول قويىدۇ.

source: Engines visible on the search menu
ug: ئىزدەش تىزىملىكىدە كۆرۈنىدىغان موتورلار

source: Enhanced Tracking Protection
ug: كۈچەيتىلگەن ئىزلاشتىن قوغداش

source: Enhanced tracking protection exception preference icon
ug: كۈچەيتىلگەن ئىز قوغلاشتىن قوغداش مۇستەسنا مايىللىق سىنبەلگىسى

source: Enhanced Tracking Protection is off for these websites
ug: كۈچەيتىلگەن ئىز قوغلاشتىن قوغداش بۇ تور بېكەتلەر ئۈچۈن تاقالغان

source: Enjoy quicker navigation that’s always at your fingertips.
ug: بەت ئالماشتۇرۇش تېخىمۇ تېز بارمىقىڭىزدا چېكىپلا ئالماشتۇرالايسىز.

source: Enter a password
ug: ئىم كىرگۈزۈلىدۇ

source: Enter a search string
ug: ئىزدەيدىغان تىزىق كىرگۈزۈلىدۇ

source: Enter a username
ug: ئىشلەتكۈچى ئاتى كىرگۈزۈلىدۇ

source: Enter a valid card number
ug: ئىناۋەتلىك كارتا نومۇرى كىرگۈزۈلىدۇ

source: Enter a valid URL
ug: ئىناۋەتلىك تور ئادرېسى كىرگۈزۈلىدۇ

source: Enter a web address
ug: تور ئادرېسى كىرگۈزۈلىدۇ

source: Entering full screen mode
ug: تولۇق ئېكران ھالىتىگە كىرىۋاتىدۇ

source: Enter search engine name
ug: ئىزدەش موتورىنىڭ ئىسمى كىرگۈزۈلىدۇ

source: Enter search terms
ug: ئىزدەيدىغان ئاتالغۇ كىرگۈزۈلىدۇ

source: Erase browsing history
ug: توركۆرگۈ تارىخىنى ئۆچۈر

source: Error Code: NS_ERROR_OFFLINE
ug: خاتالىق كودى: NS_ERROR_OFFLINE

source: Error connecting to “%s”
ug: «%s» غا باغلىنىشتا خاتالىق كۆرۈلدى

source: Everything
ug: ھەممىسى
